interThermalPhaseFoam/BubblySGS/BubblySGS_300/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    BotWall
    {
        type            fixedValue;
        value           uniform 298;
    }
    FreeStream
    {
        type            fixedValue;
        value           uniform 298;
    }
    FrontNBack
    {
        type            empty;
    }
    LeftSide
    {
        type            symmetryPlane;
    }
    RightSide
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
