interThermalPhaseFoam/BubblySGS/BubblySGS_300/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    BotWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    FreeStream
    {
        type            zeroGradient;
    }

    FrontNBack
    {
        type            empty;
    }

	LeftSide
	{
		type            symmetryPlane;
	}

	RightSide
	{
		type            symmetryPlane;
	}
}


// ************************************************************************* //
